app/controllers/todo_list_items_controller.rb

INSERT INTO "todo_list_items" ("todo_list_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["todo_list_id", 1], ["title", "Eat"], ["created_at", "2019-04-28 09:23:42.559108"], ["updated_at", "2019-04-28 09:23:42.559108"]]
---
  def create
    @todo_list_item = @todo_list.todo_list_items.new(todo_list_item_params)

    if @todo_list_item.save

UPDATE "todo_list_items" SET "title" = $1, "updated_at" = $2 WHERE "todo_list_items"."id" = $3  [["title", "Sleep - 1"], ["updated_at", "2019-04-28 09:25:04.422592"], ["id", 1]]
---
  def update
    if @todo_list_item.update(todo_list_item_params)

DELETE FROM "todo_list_items" WHERE "todo_list_items"."id" = $1  [["id", 1]]
---
  def destroy
    @todo_list_item.destroy

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_id" = $1 AND "todo_list_items"."id" = $2 LIMIT $3  [["todo_list_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_todo_list_item
      @todo_list_item = @todo_list.todo_list_items.find_by_id(params[:id])
      puts "=test==="
      puts @todo_list_item.to_json
      puts "===="
      render json: { messge: "List item not found." }, status: 404 if @todo_list_item.blank?

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find_by_id(params[:todo_list_id])