app/controllers/todo_lists_controller.rb

SELECT "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_id" IN ($1, $2)  [["todo_list_id", 3], ["todo_list_id", 1]]
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1  [["user_id", 2]]
---
  def index
    @page = params[:page] ? params[:page].to_i : 1
    @size = params[:size] ? params[:size].to_i : 10
    @todo_lists = current_user.todo_lists.includes(:todo_list_items).page(@page).per(@size)

INSERT INTO "todo_lists" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["title", "This is first ToDoList"], ["description", "Test"], ["created_at", "2019-04-28 08:57:35.115311"], ["updated_at", "2019-04-28 08:57:35.115311"]]
---
  def create
    @todo_list = current_user.todo_lists.new(todo_list_params)

    if @todo_list.save

UPDATE "todo_lists" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "todo_lists"."id" = $4  [["title", "This is first ToDoList - One"], ["description", "Test - 1"], ["updated_at", "2019-04-28 09:10:22.969457"], ["id", 1]]
---
  def update
    if @todo_list.update(todo_list_params)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = $1 AND "todo_lists"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = current_user.todo_lists.find(params[:id])
      render json: { messge: "Record not found with ID" }, status: 404 if @todo_list.blank?