app/models/todo_list_item.rb

    def update_todo_list
      todo_list.update_completed if completed && completed_changed?
---
UPDATE "todo_list_items" SET "completed" = $1, "updated_at" = $2 WHERE "todo_list_items"."id" = $3  [["completed", true], ["updated_at", "2019-04-28 09:34:53.688158"], ["id", 2]]